Revit 2026 API

# FamilyManagerMakeReporting Method

---

Set the family parameter as a reporting parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MakeReporting(
	FamilyParameter familyParameter
)
```
```vb
Public Sub MakeReporting (
	familyParameter As FamilyParameter
)
```
```cpp
public:
void MakeReporting(
	FamilyParameter^ familyParameter
)
```
```fsharp
member MakeReporting :
        familyParameter : FamilyParameter -> unit
```

#### Parameters

familyParameter FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| InvalidOperationException | Thrown when the parameter can not be changed to a reporting parameter. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace